/* General */

"YES" = "نعم";

"Coming soon" = "قادم قريباً";

"Calculation error" = "خطأ حسابي";

"and" = "و";

"Answer" = "اجابة (حل)";

"Name" = "اسم";

"NO" = "لا";

"Solution" = "الحل عن طريق العمليات";

"solution" = "من خلال العملية";

"Task" = "مسألة";

"Save & Exit" = "حفظ و خروج";

"You can't delete error." = "لا تستطيع حذف حل ان كنت قد ارتكبت فيه خطأ.";

"Message" = "رسالة";


/* level map */

"Oops! You made more than two mistakes. You can't continue solving the test problems until you finish solving the previous problems of this type" = "لا! لقد اخطأت اكثر من مرتين. لا تستطيع الاستمرار في حل مسائل الامتحان حتى تنهي حل المسائل السابقة من هذا الصنف";

/* S&E level page label */

"Problem" = "مسألة";

"problem" = "مسألة";

"Training" = "تدريب";


/* Exercises page */

"%@ points from %@" = "%1$@ نقاط من اصل %2$@";

"find one more way to solve this problem and earn %d points more" = "اوجد طريقة اخرى لحل هذه المسألة واكسب %d نقاط اخري ";

"you have solved this problem with all possible solution and expression" = "تم ايجاد جميع الحلول الممكنة";


/* Solving page */
"Expression" = "معادلة رياضية";

"expression" = "معادلة";

"Add answer" = "اضف اجابة";

"Save & Exit" = "حفظ و خروج";

"Answers are not identical to each other." = "الاجابات غير متطابقة مع بعضها البعض.";

"Change answer" = "عدل الاجابة";

"Answer field is empty" = "خانة الاجابة فارغة";

"Task can have just one correct answer! Input the same ANSWER to all fields" = "للمسألة حل واحد صحيح فقط! ادخل نفس الحل في كل الخانات";

"Mistake put scheme message" = "يجب ان تجد الغرض الصحيح وان تقوم بسحبه لعمل الرسم";

"Task is not solved with all possible variants." = "لم يتم ايجاد كل الحلول الممكنة.";

"Task is solved with all possible solutions and expressions" = "تم ايجاد كل الحلول الممكنة";

"Delete" = "مسح";

"Add operation?" = "اضف عمليه";

"Delete operation?" = "مسح العملية؟";



/* Statistics */
"Day" = "يوم";

"Month" = "شهر";

"Understanding error" = "خطأ في الفهم";

"Week" = "اسبوع";
/* Got star for test level completion */
"%02i.%02i %@ (Got star)" = "%1$i.%2$i %3$@ حصلت علي نجمه";
/* Solved level/path */
"%02i.%02i %@ (Solved)" = "%1$i.%2$i %3$@ (حلت)";


//tutorial
"tap to see animation!" = "المس هنا حتى ترى الرسوم المتحركة!";

"tap to build diagram here!" = "المس هنا حتى تصنع الرسم البياني !";

"drag the items here to make diagram!" = "اسحب العناصر (الاغراض) الى هنا حتى تصنع الرسم البياني !";

"tap to solve the problem!" = "المس هنا لحل المسألة !";

"drag & drop the numbers here to solve the problem!" = "اسحب الارقام هنا لحل المسألة !";

"tap to see the mistake!" = "المس هنا لرؤية الخطأ";

//new solving

"Solution1" = "الحل";

"math expression" = "عن طريق المعادلة الرياضية";

"math solution" = "من خلال العمليات الحسابية";

"scheme_success_message" = "رائع! اكتمل الرسم البياني !";

"The same solutions, change one of them!" = "لقد ادخلت نفس الحلول, عدل أو احذف احدهما!";



/* Logout */

"Are you sure you want to exit your profile? All your data will be save and you can come back any time." = "هل انت متأكد من انك تريد الخروج من حسابك؟ سيتم حفظ كل بياناتك وتستطيع العودة في اي وقت.";

"Cancel" = "الغاء";

"OK" = "موافق";



/* Settings */

"Enter your facebook account to continue" = "ادخل حساب فيسبوك الخاص بك للاستمرار";

"Enter your mail account to continue" = "ادخل حساب بريدك الالكتروني للاستمرار";


/* Profile achievements event status */
"Error" = "خطأ";

/* Popup error description */
"Structure and calculation error" = "خطأ في الحساب والفهم";

/* Popup error description */
"Structure error" = "خطأ في الفهم";



/* Solved level/path */
"Solved" = "تم حلها (حلت)";
/* Profile achievements event status */
"Solved task" = "تم حلها (حلت)";
/* Profile achievements event status */
"Started task" = "تم البدء";



/* Olympiad solving page */
"There are empty gaps. You should fill every gap" = "لا تزال هناك مساحات فارغة. عليك ان تملأها";



/* Mail registration  popup */



/* Back-end errors */

"Unable to perform action" = "لم نستطع تنفيذ العملية";

"Email and Password fields are required" = "خانتي البريد الالكتروني وكلمة المرور مطلوبتان";

"Incorrect email format" = "صيغة البريد الالكتروني غير صحيحة";

"User with same email already exists" = "هناك حساب مستخدم بنفس البريد الالكتروني موجود اصلاً";

"Incorrect password" = "كلمة المرور غير صحيحة";

"User not found" = "المستخدم غير موجود";

"User not found, you need to specify email to register" = "المستخدم غير موجود, عليك ان تحدد بريداً الكترونياً للتسجيل";

"Name field is required" = "خانة الاسم مطلوبة";

"Child with this name already exists" = "هناك طفل بهذا الاسم موجود اصلاً";

"Child not found" = "الطفل غير موجود";

"You need to set active child" = "عليك ان تختار طفلاً نشطاً";

"Permissions Denied" = "الاذن مرفوض";

"Authorization Error" = "خطأ في التصريح";

"Synchronizing. Tap to cancel" = "المزامنة قيد التنفيذ. انقر الشاشة للالغاء";

"Synchronizing" = "مزامنة";

"Sending data" = "جاري ارسال البيانات";

"Getting data" = "جاري الحصول على البيانات";



/* post to FB */

"I solved test problem #%@ from the topic \"%@\"!" = "لقد حللت مسألة الامتحان #%@ من الموضوع /%@/!";

"I solved all the test problems from the topic \"%@\"!" = "لقد حللت جميع مسائل الامتحان للموضوع /%@/!";

"I solved olympiad problem #%@ of the first level of the \"%@\"!" = "لقد حللت مسألة الاوليمبياد #%@ من المستوى الاول في /%@/!";

"I solved the first level of the \"%@\"!" = "لقد حللت المستوى الاول من /%@/!";


/* parent help */

"- %@ level of difficulty" = "- %@ مستوى الصعوبة";

"- Solve %@ problems" = "- قم بحل %@ مسائل";

"- %@ test problems" = "- %@ مسائل امتحان";

"%i. Witty olympiad problems %i levels with %@ problems in each" = "مسائل اوليمبياد بارعة % مستويات بها %@ مسائل في كل مستوى";

"A total of %@ problems, %@ test problems, %@ olympiad problems" = "المجموع %@ مسائل, %@ مسائل امتحان, %@ مسائل اوليمبياد";



/* animation alert*/

"You need an internet connection in order to watch the animation" = "ستحتاج الى الاتصال بالانترنت لمشاهدة الرسوم المتحركة";

"Server Error" = "الخادم غير موجود مؤقتاً. نعتذر ان كان هناك ازعاج. نحن نقوم بتعزيز عمل الخادم. بامكانك الاستمرار بالعمل دون الاتصال بالانترنت أو العودة لاحقاً الى التطبيق.";


/* Registration */
/* Mail */

"Enter your account" = "ادخل حسابك";

"Enter your password" = "ادخل كلمة المرور الخاصة بك";

"You should input all rows" = "يجب ان تعبئ جميع الخانات";

"Enter child name" = "ادخل اسم الطفل";

"Please enter your name" = "ادخل اسمك";

"You need to confirm your e-mail before continue" = "يجب ان تؤكد بريدك الالكتروني قبل الاستمرار";

"Failed to get location, check your network connection" = "ان لم تستطع اختيار الموقع الآن فالرجاء التأكد من اتصالك بالانترنت  ثم حدث لاحقاً في صفحة الاعدادات";

"Dismiss" = "اغلاق";

"Invalid nickname. You can use only Latin/Cyrillic symbols, whitespaces, digits and symbols '.-_'. Maximum is 15 symbols" = "يمكن ان يتألف الاسم من الحروف والارقام أ - ي, 0 - 9؛ الفراغ؛ الرموز '.-_' ولا يزيد طولها عن 15 حرف(رمز) ولا تقل عن حرفين (رمزين).";

"Invalid email" = "البريد الالكتروني غير صحيح";

"Invalid password. Input from 6 to 15 symbols" = "كلمة المرور غير صحيحة. ادخل من 6 الى 15 حرفاً (رمزاً)";

"Censored nickname error" = "لا يسمح بهذا الاسم. الرجاء التفقد وادخال اسم آخر.";

" Child's progress will be lost!" = " سيتم حذف تقدم طفلك!";

"Explain default label" = "للتسجيل, اضغط على موافق للاستمرار في استخدام التطبيق, اضغط استمرار";

"Set name for default child" = "ادخل اسم الطفل";

"Explain default label4" = "للتسجيل, اضغط على موافق للاستمرار في استخدام التطبيق, اضغط على الغاء!";

"Done" = "انتهى";

"Passwords don't match" = "كلمات المرور غير متطابقة";

"Password is changed" = "تم تغيير كلمة المرور";

"Password was sent to your e-mail" = "تم ارسال كلمة المرور الى بريدك الالكتروني";

"Register" = "التسجيل";

"Login" = "تسجيل الدخول";



/* Delete child */

"Remove child %@ confirmation" = "هل تريد مسح حساب %@ من تطبيق LocaMath؟ جميع الاحصائيات سيتم حذفها!";

"Remove child %@ confirmation email" = "تم ارسال رسالة اليك لتأكيد الغاء حسابك. تفقد بريدك وقم بالتأكيد ان كنت تريد مسح حساب %@.";

"Confirm_ERROR" = "خطأ كلمات المرور غير متطابقة !";



//Warning on attempt to solve test tasks with 2 tasks failed already
"Oops! You made more than two mistakes. You can't continue solving the test problems until you finish solving the previous problems of this type"= "نأسف, يجب ان لا يكون لديك اكثر من خطئين حتى تستمر. الرجاء العودة الى المستويات الفرعية السابقة واتمام كل المسائل";



//default popup


"Continue" = "الاستمرار";

"Points earned" = "النقاط التي كسبتها";

"Attention" = "!الانتباه";


/* facebook */

"https://www.facebook.com/Locamath" = "https://www.facebook.com/Locamath";

"fb_Locamath" = "fb://profile/279755092127204";

"The Internet connection appears to be offline." = "يبدو ان الاتصال بالانترنت مقطوع.";

"No internet connection, вы не можете зарегистрироваться через FB при отсутствии интернета, зарегистрируйтесь при помощи почты" = "بدون  الاتصال بالانترنت تستطيع فقط التسجيل باستخدام البريد الالكتروني";

"Check facebook permissions and try again later" = "تفقد تصاريح (اعدادات) الفيسبوك وحاول مرة اخرى لاحقاً";

"The version is application is lower than required/ Please update your application/" = "يجب ان تحدث التطبيق حتى يعمل بشكل صحيح! ";





/* Home screen on tap Olympiad */
"Child not selected." = "لم يتم اختيار الطفل.";

/* Solving page */
"You can add just expression for this task!" = "تم حل هذه المسألة بمساعدة عملية حسابية!";



/* Solving page */
"You have added all possible expressions" = "لقد وجدت جميع الحلول الممكنة عن طريق المعادلة الحسابية";

/* Solving page */
"You have added all possible solutions" = "لقد وجدت جميع الحلول الممكنة عن طريق العملية الحسابية";




//default popup


"Explain default label0" = "بدون التسجيل:\n\n لن يستطيع الطفل ان يشارك في الترتيب وان ينافس الاطفال الآخرين!\n\n يستطيع طفل واحد فقط استخدام التطبيق!\n\n لن تتمكن من الحصول على تقارير عن الاحصائيات وعن تقدم طفلك! \n\n";

"Explain default label1" = "هذا القسم هو لاعضاء فريقنا! \n\n هل تريد ان تنضم الى فريقنا - اطلب من والديك التسجيل!";

"Explain default label2" = "الاهالي الاعزاء, \n\n هذه صفحة التقارير والاحصائيات. \n\n نريدكم ان تسجلوا حتى نستطيع ان نوفر لكم المعلومات حول تقدم طفلكم!";







/* should delete */


"Pull to refresh" = "اسحب لاعادة التحميل";


